tvendov/vkth_micropython/ports/renesas-ra/boards/VK_RA4M2/examples/arduino/Vekatech-ArduinoCore-renesas-1.5.3/boards.txt
### VK Boards ###
##############################################################

vknanor4.name=VK NANO R4
vknanor4.build.core=arduino
vknanor4.build.crossprefix=arm-none-eabi-
vknanor4.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/

vknanor4.build.variant=VK_NANOR4
vknanor4.build.mcu=cortex-m4
vknanor4.build.architecture=cortex-m4
vknanor4.build.fpu=-mfpu=fpv4-sp-d16
vknanor4.build.float-abi=-mfloat-abi=hard

vknanor4.build.board=vknanor4
#vknanor4.build.usb_product="VK NANO R4"
vknanor4.build.defines=-DF_CPU=48000000 -DARDUINO_VK_NANO_R4 -DARDUINO_UNOR4_MINIMA
vknanor4.vid.0=0x2341
vknanor4.pid.0=0x0074
vknanor4.vid.1=0x2341
vknanor4.pid.1=0x0374
vknanor4.upload_port.0.vid=0x2341
vknanor4.upload_port.0.pid=0x0074
vknanor4.upload_port.1.vid=0x2341
vknanor4.upload_port.1.pid=0x0374

vknanor4.compiler.fsp.defines={build.variant.path}/defines.txt
vknanor4.compiler.fsp.ldflags={build.variant.path}/ldflags.txt
vknanor4.compiler.fsp.cflags=-mthumb "@{compiler.fsp.defines}"
vknanor4.compiler.fsp.cxxflags=-mthumb "@{compiler.fsp.defines}"
vknanor4.compiler.tinyusb.cflags=-DCFG_TUSB_MCU=OPT_MCU_RAXXX
vknanor4.compiler.tinyusb.cxxflags=-DCFG_TUSB_MCU=OPT_MCU_RAXXX
vknanor4.compiler.fsp.includes={build.variant.path}/includes.txt
vknanor4.compiler.fsp.extra_ldflags=--specs=nano.specs -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
vknanor4.compiler.fsp="{build.variant.path}/libs/libfsp.a"

vknanor4.upload.tool=dfu-util
vknanor4.upload.tool.default=dfu-util
vknanor4.upload.protocol=
vknanor4.upload.transport=
vknanor4.upload.vid=0x2341
vknanor4.upload.pid=0x0374
vknanor4.upload.address=0x00010000
vknanor4.upload.interface=0
vknanor4.upload.use_1200bps_touch=false
vknanor4.upload.wait_for_upload_port=false
vknanor4.upload.native_usb=true
vknanor4.upload.maximum_size=196608
vknanor4.upload.maximum_data_size=32768

vknanor4.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
vknanor4.debug.server.openocd.scripts.1={programmer.transport_script}
vknanor4.debug.server.openocd.scripts.2={runtime.platform.path}/debugger/R7FA4M1AB.cfg
vknanor4.debug.svd_file={runtime.platform.path}/svd/R7FA4M1AB.svd

##############################################################
### VK Boards END ###
